In [48]:
import numpy as np
import pandas as pd

In [49]:
data = np.random.randn(4,3)
data

array([[ 0.25939992,  0.22329171,  0.26408218],
       [ 0.82480899, -0.45072922,  0.55022543],
       [-0.03926033, -1.24863521,  0.63173485],
       [-0.00652508, -0.5552945 , -0.37828752]])

In [50]:
dataFrame = pd.DataFrame(data)
dataFrame

          0         1         2
0  0.259400  0.223292  0.264082
1  0.824809 -0.450729  0.550225
2 -0.039260 -1.248635  0.631735
3 -0.006525 -0.555294 -0.378288

In [51]:
dataFrame[0]   #first Coloumn

0    0.259400
1    0.824809
2   -0.039260
3   -0.006525
Name: 0, dtype: float64

In [52]:
type(dataFrame[0])

pandas.core.series.Series

In [53]:
newDataFrame = pd.DataFrame(data,index=["Ömer","Beytullah","Yaren","Emin"],columns=["Age","Salary","BirthYear"])
newDataFrame

                Age    Salary  BirthYear
Ömer       0.259400  0.223292   0.264082
Beytullah  0.824809 -0.450729   0.550225
Yaren     -0.039260 -1.248635   0.631735
Emin      -0.006525 -0.555294  -0.378288

In [54]:
newDataFrame["Age"]

Ömer         0.259400
Beytullah    0.824809
Yaren       -0.039260
Emin        -0.006525
Name: Age, dtype: float64

In [55]:
newDataFrame[["Age","Salary"]]

                Age    Salary
Ömer       0.259400  0.223292
Beytullah  0.824809 -0.450729
Yaren     -0.039260 -1.248635
Emin      -0.006525 -0.555294

In [56]:
newDataFrame.loc["Ömer"]   #get row/index

Age          0.259400
Salary       0.223292
BirthYear    0.264082
Name: Ömer, dtype: float64

In [57]:
newDataFrame.iloc[1]    #get row/index by index number

Age          0.824809
Salary      -0.450729
BirthYear    0.550225
Name: Beytullah, dtype: float64

## Data Frame Indexes

#### Adding coloumn

In [58]:
newDataFrame["Retirement Age"]= newDataFrame["Age"]+newDataFrame["Age"]
newDataFrame

                Age    Salary  BirthYear  Retirement Age
Ömer       0.259400  0.223292   0.264082        0.518800
Beytullah  0.824809 -0.450729   0.550225        1.649618
Yaren     -0.039260 -1.248635   0.631735       -0.078521
Emin      -0.006525 -0.555294  -0.378288       -0.013050

#### Drop/Delete Coloumn

In [59]:
newDataFrame.drop("Retirement Age",axis=1) #axis=0 row, axis= coloumn

                Age    Salary  BirthYear
Ömer       0.259400  0.223292   0.264082
Beytullah  0.824809 -0.450729   0.550225
Yaren     -0.039260 -1.248635   0.631735
Emin      -0.006525 -0.555294  -0.378288

In [60]:
newDataFrame

                Age    Salary  BirthYear  Retirement Age
Ömer       0.259400  0.223292   0.264082        0.518800
Beytullah  0.824809 -0.450729   0.550225        1.649618
Yaren     -0.039260 -1.248635   0.631735       -0.078521
Emin      -0.006525 -0.555294  -0.378288       -0.013050

In [61]:
newDataFrame.drop("Emin")

                Age    Salary  BirthYear  Retirement Age
Ömer       0.259400  0.223292   0.264082        0.518800
Beytullah  0.824809 -0.450729   0.550225        1.649618
Yaren     -0.039260 -1.248635   0.631735       -0.078521

In [62]:
newDataFrame

                Age    Salary  BirthYear  Retirement Age
Ömer       0.259400  0.223292   0.264082        0.518800
Beytullah  0.824809 -0.450729   0.550225        1.649618
Yaren     -0.039260 -1.248635   0.631735       -0.078521
Emin      -0.006525 -0.555294  -0.378288       -0.013050

In [63]:
newDataFrame.drop("Retirement Age",axis=1,inplace=True) #permanently delete

In [64]:
newDataFrame.loc["Ömer"]["Age"]

0.2593999176964488

In [65]:
newDataFrame <0

             Age  Salary  BirthYear
Ömer       False   False      False
Beytullah  False    True      False
Yaren       True    True      False
Emin        True    True       True

In [66]:
booleanFrame = newDataFrame <0
booleanFrame

             Age  Salary  BirthYear
Ömer       False   False      False
Beytullah  False    True      False
Yaren       True    True      False
Emin        True    True       True

In [67]:
newDataFrame[booleanFrame]

                Age    Salary  BirthYear
Ömer            NaN       NaN        NaN
Beytullah       NaN -0.450729        NaN
Yaren     -0.039260 -1.248635        NaN
Emin      -0.006525 -0.555294  -0.378288

In [68]:
newDataFrame[newDataFrame<0]

                Age    Salary  BirthYear
Ömer            NaN       NaN        NaN
Beytullah       NaN -0.450729        NaN
Yaren     -0.039260 -1.248635        NaN
Emin      -0.006525 -0.555294  -0.378288

In [69]:
newDataFrame[newDataFrame["Age"]<0]

            Age    Salary  BirthYear
Yaren -0.039260 -1.248635   0.631735
Emin  -0.006525 -0.555294  -0.378288

### Changing Index

In [70]:
newDataFrame.reset_index()

       index       Age    Salary  BirthYear
0       Ömer  0.259400  0.223292   0.264082
1  Beytullah  0.824809 -0.450729   0.550225
2      Yaren -0.039260 -1.248635   0.631735
3       Emin -0.006525 -0.555294  -0.378288

In [71]:
newDataFrame

                Age    Salary  BirthYear
Ömer       0.259400  0.223292   0.264082
Beytullah  0.824809 -0.450729   0.550225
Yaren     -0.039260 -1.248635   0.631735
Emin      -0.006525 -0.555294  -0.378288

In [72]:
newIndexList= ["Ö","B","Y","E"]

In [73]:
newDataFrame["New Indexes"]= newIndexList
newDataFrame

                Age    Salary  BirthYear New Indexes
Ömer       0.259400  0.223292   0.264082           Ö
Beytullah  0.824809 -0.450729   0.550225           B
Yaren     -0.039260 -1.248635   0.631735           Y
Emin      -0.006525 -0.555294  -0.378288           E

In [75]:
newDataFrame.set_index("New Indexes") #own column just can be index

                  Age    Salary  BirthYear
New Indexes
Ö            0.259400  0.223292   0.264082
B            0.824809 -0.450729   0.550225
Y           -0.039260 -1.248635   0.631735
E           -0.006525 -0.555294  -0.378288

In [76]:
newDataFrame #of course, you should assign to variable or inplace = True

                Age    Salary  BirthYear New Indexes
Ömer       0.259400  0.223292   0.264082           Ö
Beytullah  0.824809 -0.450729   0.550225           B
Yaren     -0.039260 -1.248635   0.631735           Y
Emin      -0.006525 -0.555294  -0.378288           E

### Multi Indexes

In [77]:
outerIndexses =["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [78]:
innerIndexes=["Homer","Bard","Marge","Cartman","Kenny","Kyle"]

In [80]:
combinedIndexes = list(zip(outerIndexses,innerIndexes))
type(combinedIndexes)
combinedIndexes

list

In [82]:
combinedIndexes = pd.MultiIndex.from_tuples(combinedIndexes)
type(combinedIndexes)
combinedIndexes

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bard'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [84]:
info = np.array([["A",40],["B",40],["c",10],["d",10],["e",5],["x",4]])
info

array([['A', '40'],
       ['B', '40'],
       ['c', '10'],
       ['d', '10'],
       ['e', '5'],
       ['x', '4']], dtype='<U11')

In [85]:
cartoon = pd.DataFrame(info,index=combinedIndexes,columns=["Job","Age"])

In [86]:
cartoon

                   Job Age
Simpson    Homer     A  40
           Bard      B  40
           Marge     c  10
South Park Cartman   d  10
           Kenny     e   5
           Kyle      x   4

In [88]:
cartoon.loc["Simpson"]

      Job Age
Homer   A  40
Bard    B  40
Marge   c  10

In [92]:
cartoon.loc["Simpson","Homer"]

Job     A
Age    40
Name: (Simpson, Homer), dtype: object

cartoon.loc["Simpson","Homer"] == cartoon.loc["Simpson"].loc["Homer"]

In [93]:
cartoon.loc["Simpson"].loc["Homer"]

Job     A
Age    40
Name: Homer, dtype: object